app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
	 	@comment = @post.comments.create(params[:comment].permit(:name, :comment))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "ff"], ["comment", "ff"], ["created_at", "2018-10-29 08:48:00.822711"], ["updated_at", "2018-10-29 08:48:00.822711"], ["post_id", 7]]